phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/spi.c
/*
 * Phoenix-RTOS
 *
 * i.MX RT SPI driver
 *
 * Copyright 2019 Phoenix Systems
 * Author: Hubert Buczynski
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */


#include <errno.h>
#include <stdint.h>
#include <sys/interrupt.h>
#include <sys/msg.h>
#include <sys/threads.h>

#include "common.h"
#include "spi.h"

#define SPI1_POS 0
#define SPI2_POS (SPI1_POS + SPI1)
#define SPI3_POS (SPI2_POS + SPI2)
#define SPI4_POS (SPI3_POS + SPI3)
#define SPI5_POS (SPI4_POS + SPI4)
#define SPI6_POS (SPI5_POS + SPI5)

#define SPI_CNT (SPI1 + SPI2 + SPI3 + SPI4 + SPI5 + SPI6)

#define MAX_FRAME_SZ 0x1000
#define WORD_SIZE sizeof(uint32_t)
#define MAX_FIFOSZ_BYTES 16 * WORD_SIZE


enum { spi_verid = 0, spi_param, spi_cr = 0x4, spi_sr, spi_ier, spi_der, spi_cfgr0, spi_cfgr1, spi_dmr0 = 0xc,
	   spi_dmr1, spi_ccr = 0x10, spi_fcr = 0x16, spi_fsr, spi_tcr, spi_tdr, spi_rsr = 0x1c, spi_rdr };


struct {
	handle_t cond;
	handle_t mutex;
	handle_t inth;
	handle_t irqLock;

	int irq;
	volatile int ready;
	volatile uint32_t *base;

	uint32_t tcr;
} spi_common[SPI_CNT];


static const int spiConfig[] = { SPI1, SPI2, SPI3, SPI4 , SPI5, SPI6};


static const int spiPos[] = { SPI1_POS, SPI2_POS, SPI3_POS, SPI4_POS , SPI5_POS, SPI6_POS};


static inline uint32_t spi_deserializeWord(const uint8_t *buff)
{
	uint32_t word = 0;

	word = buff[3] | (buff[2] << 8) | (buff[1] << 16) | (buff[0] << 24);

	return word;
}


static inline void spi_serializeWord(uint8_t *buff, uint32_t word, int8_t start)
{
	for (int i = start - 1; i >= 0; --i)
		*buff++ = (word >> (i * 8)) & 0xff;
}


static int spi_irqHandler(unsigned int n, void *arg)
{
	int spi = (int)arg;

	*(spi_common[spi].base + spi_ier) = 0;
	spi_common[spi].ready = 1;

	return 0;
}


static void spi_initTransmition(int spi)
{
	mutexLock(spi_common[spi].irqLock);
	spi_common[spi].ready = 0;

	*(spi_common[spi].base + spi_ier) |= 1;

	while (!spi_common[spi].ready)
		condWait(spi_common[spi].cond, spi_common[spi].irqLock, 0);

	mutexUnlock(spi_common[spi].irqLock);
}

static void spi_initRcv(int spi)
{
	mutexLock(spi_common[spi].irqLock);
	spi_common[spi].ready = 0;

	*(spi_common[spi].base + spi_ier) |= 1 << 1;

	while (!spi_common[spi].ready)
		condWait(spi_common[spi].cond, spi_common[spi].irqLock, 0);

	mutexUnlock(spi_common[spi].irqLock);
}


static void spi_txBytes(int spi, const uint8_t *txBuff, int bytesNumber)
{
	uint32_t word;

	while (bytesNumber / WORD_SIZE) {
		*(spi_common[spi].base + spi_tdr) = spi_deserializeWord(txBuff);
		txBuff += WORD_SIZE;
		bytesNumber -= WORD_SIZE;
	}

	if (bytesNumber) {
		word = 0;
		while (bytesNumber--)
			word = (word << 8) | *txBuff++;
		*(spi_common[spi].base + spi_tdr) = word;
	}
}


static void spi_rxBytes(int spi, uint8_t *rxBuff, int bytesNumber)
{
	uint32_t word;

	/* Get data from RX Fifo */
	while (bytesNumber / WORD_SIZE) {
		word = *(spi_common[spi].base + spi_rdr);
		spi_serializeWord(rxBuff, word, WORD_SIZE);
		rxBuff += WORD_SIZE;
		bytesNumber -= WORD_SIZE;
	}

	if (bytesNumber) {
		word = *(spi_common[spi].base + spi_rdr);
		spi_serializeWord(rxBuff, word, bytesNumber);
		rxBuff += bytesNumber;
	}
}


static int spi_performTranscation(int spi, unsigned char cs, const uint8_t *txBuff, uint8_t *rxBuff, int len)
{
	int size = len;
	int rxTotalBytes = 0;
	int txFifoBytes, rxFifoBytes;
	uint32_t txWordsCnt, rxWordsCnt;

	if (!spiConfig[spi])
		return -EINVAL;

	if ((len * 8) > MAX_FRAME_SZ)
		return -EINVAL;

	spi = spiPos[spi];

	mutexLock(spi_common[spi].mutex);

	/* Initialize Transmit Command Register */
	*(spi_common[spi].base + spi_tcr) = (spi_common[spi].tcr & ~(0x7ff)) | ((cs & 0x3) << 24) | (len * 8 - 1);

	/* Wait until Transmit Command will be taken from  TX fifo */
	txWordsCnt = *(spi_common[spi].base + spi_fsr) & 0x1f;
	while (txWordsCnt)
		txWordsCnt = ((*(spi_common[spi].base + spi_fsr)) & 0x1f);

	while (size > 0) {
		if (size <= MAX_FIFOSZ_BYTES)
			txFifoBytes = size;
		else
			txFifoBytes = MAX_FIFOSZ_BYTES;

		txWordsCnt = (txFifoBytes + WORD_SIZE - 1) / WORD_SIZE;
		/* Set rx watermark */
		*(spi_common[spi].base + spi_fcr) = (*(spi_common[spi].base + spi_fcr) & ~(0xf << 16)) | (((txWordsCnt - 1) & 0xf) << 16);

		/* Fill transmit FIFO */
		spi_txBytes(spi, txBuff, txFifoBytes);
		txBuff += txFifoBytes;
		size -= txFifoBytes;

		/* Transfer data into slave */
		spi_initTransmition(spi);

		/* RCV data from slave */
		spi_initRcv(spi);
		rxWordsCnt = (*(spi_common[spi].base + spi_fsr) >> 16) & 0x1f;

		/* Get data from receive FIFO */
		rxFifoBytes = rxWordsCnt * WORD_SIZE;
		if ((rxFifoBytes + rxTotalBytes) > len)
			rxFifoBytes = len - rxTotalBytes;

		spi_rxBytes(spi, rxBuff, rxFifoBytes);
		rxBuff += rxFifoBytes;
		rxTotalBytes += rxFifoBytes;
	}

	/*
	 * If data length is a multiplication of MAX_FIFOSZ_BYTES, Transmit Command moves one word out of FIFO.
	 * The last word is received after trasnsmission.
	 */
	rxFifoBytes = len - rxTotalBytes;

	if (rxFifoBytes) {
		rxWordsCnt = (*(spi_common[spi].base + spi_fsr) >> 16) & 0x1f;
		if (rxWordsCnt) {
			spi_rxBytes(spi, rxBuff, rxFifoBytes);
			rxTotalBytes += rxFifoBytes;
		}
	}

	mutexUnlock(spi_common[spi].mutex);

	return rxTotalBytes;
}


static int spi_configure(uint32_t spi, uint32_t bdiv, uint32_t prescaler, uint32_t endian, uint32_t mode, uint32_t cs)
{
	int i;

	if (!spiConfig[spi])
		return -EINVAL;

	if (bdiv > 255)
		return -EINVAL;

	if (prescaler >= 8)
		return -EINVAL;

	i = spiPos[spi];

	mutexLock(spi_common[i].mutex);

	/* Disable module */
	*(spi_common[i].base + spi_cr) = 0;

	/* Software reset */
	*(spi_common[i].base + spi_cr) |= 1 << 1;
	*(spi_common[i].base + spi_cr) = 0;

	/* Set master mode as default */
	*(spi_common[i].base + spi_cfgr1) |= 1;

	/* CS polarity: 0 - low */
	*(spi_common[i].base + spi_cfgr1) &= ~(0xf << 8);

	/* Set pin configuration */
	*(spi_common[i].base + spi_cfgr1) &= ~(1 << 26) & ~(3 << 24);

	/* Enable Module */
	*(spi_common[i].base + spi_cr) |= 1;

	/* Set baudrate divider */
	*(spi_common[i].base + spi_ccr) = (*(spi_common[i].base + spi_ccr) & ~0xff) | bdiv;

	/* Set watermarks */
	*(spi_common[i].base + spi_fcr) &=  ~(0xf << 16) & ~0xf;

	/* Set transmit command register */
	*(spi_common[i].base + spi_tcr) &= ~(1 << 26); /* reset register */
	spi_common[i].tcr = *(spi_common[i].base + spi_tcr) | ((mode & 0x3) << 30) | ((cs & 0x3) << 24) | ((endian & 0x1) << 23) | (prescaler << 27);

	mutexUnlock(spi_common[i].mutex);

	return EOK;
}


static void spi_handleDevCtl(msg_t *msg, int dev)
{
	multi_i_t *idevctl = (multi_i_t *)msg->i.raw;

	dev -= id_spi1;

	uint8_t *rxBuff = (uint8_t *)msg->o.data;
	const uint8_t *txBuff = (const uint8_t *)msg->i.data;

