phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/spi.c
	switch (idevctl->spi.type) {
		case spi_config:
			msg->o.err = spi_configure(dev, idevctl->spi.config.sckDiv, idevctl->spi.config.prescaler, idevctl->spi.config.endian, idevctl->spi.config.mode, idevctl->spi.config.cs);
			break;

		case spi_transaction:
			msg->o.err = spi_performTranscation(dev, idevctl->spi.transaction.cs, txBuff, rxBuff, idevctl->spi.transaction.frameSize);
			break;

		default:
			msg->o.err = -ENOSYS;
			break;
	}
}


int spi_handleMsg(msg_t *msg, int dev)
{
	switch (msg->type) {
		case mtGetAttr:
		case mtSetAttr:
		case mtOpen:
		case mtClose:
		case mtWrite:
		case mtRead:
			msg->o.err = EOK;
			break;

		case mtDevCtl:
			spi_handleDevCtl(msg, dev);
			break;

		default:
			msg->o.err = -ENOSYS;
			break;
	}

	return EOK;
}


#ifdef __CPU_IMXRT117X

static int spi_getIsel(int mux, int *isel, int *val)
{
	switch (mux) {
		case pctl_mux_gpio_emc_b2_01 :  *isel = pctl_isel_lpspi1_pcs_0; *val = 0; break;
		case pctl_mux_gpio_ad_29 :      *isel = pctl_isel_lpspi1_pcs_0; *val = 1; break;
		case pctl_mux_gpio_emc_b2_00 :  *isel = pctl_isel_lpspi1_sck; *val = 0; break;
		case pctl_mux_gpio_ad_28 :      *isel = pctl_isel_lpspi1_sck; *val = 1; break;
		case pctl_mux_gpio_emc_b2_03 :  *isel = pctl_isel_lpspi1_sdi; *val = 0; break;
		case pctl_mux_gpio_ad_31 :      *isel = pctl_isel_lpspi1_sdi; *val = 1; break;
		case pctl_mux_gpio_emc_b2_02 :  *isel = pctl_isel_lpspi1_sdo; *val = 0; break;
		case pctl_mux_gpio_ad_30 :      *isel = pctl_isel_lpspi1_sdo; *val = 1; break;
		case pctl_mux_gpio_ad_25 :      *isel = pctl_isel_lpspi2_pcs_0; *val = 0; break;
		case pctl_mux_gpio_sd_b2_08 :   *isel = pctl_isel_lpspi2_pcs_0; *val = 1; break;
		case pctl_mux_gpio_ad_21 :      *isel = pctl_isel_lpspi2_pcs_1; *val = 0; break;
		case pctl_mux_gpio_sd_b2_11 :   *isel = pctl_isel_lpspi2_pcs_1; *val = 1; break;
		case pctl_mux_gpio_ad_24 :      *isel = pctl_isel_lpspi2_sck; *val = 0; break;
		case pctl_mux_gpio_sd_b2_07 :   *isel = pctl_isel_lpspi2_sck; *val = 1; break;
		case pctl_mux_gpio_ad_27 :      *isel = pctl_isel_lpspi2_sdi; *val = 0; break;
		case pctl_mux_gpio_sd_b2_10 :   *isel = pctl_isel_lpspi2_sdi; *val = 1; break;
		case pctl_mux_gpio_ad_26 :      *isel = pctl_isel_lpspi2_sdo; *val = 0; break;
		case pctl_mux_gpio_sd_b2_09 :   *isel = pctl_isel_lpspi2_sdo; *val = 1; break;
		case pctl_mux_gpio_emc_b2_05 :  *isel = pctl_isel_lpspi3_pcs_0; *val = 0; break;
		case pctl_mux_gpio_disp_b1_07 : *isel = pctl_isel_lpspi3_pcs_0; *val = 1; break;
		case pctl_mux_gpio_emc_b2_08 :  *isel = pctl_isel_lpspi3_pcs_1; *val = 0; break;
		case pctl_mux_gpio_disp_b1_08 : *isel = pctl_isel_lpspi3_pcs_1; *val = 1; break;
		case pctl_mux_gpio_emc_b2_09 :  *isel = pctl_isel_lpspi3_pcs_2; *val = 0; break;
		case pctl_mux_gpio_disp_b1_09 : *isel = pctl_isel_lpspi3_pcs_2; *val = 1; break;
		case pctl_mux_gpio_emc_b2_10 :  *isel = pctl_isel_lpspi3_pcs_3; *val = 0; break;
		case pctl_mux_gpio_disp_b1_10 : *isel = pctl_isel_lpspi3_pcs_3; *val = 1; break;
		case pctl_mux_gpio_emc_b2_04 :  *isel = pctl_isel_lpspi3_sck; *val = 0; break;
		case pctl_mux_gpio_disp_b1_04 : *isel = pctl_isel_lpspi3_sck; *val = 1; break;
		case pctl_mux_gpio_emc_b2_07 :  *isel = pctl_isel_lpspi3_sdi; *val = 0; break;
		case pctl_mux_gpio_disp_b1_05 : *isel = pctl_isel_lpspi3_sdi; *val = 1; break;
		case pctl_mux_gpio_emc_b2_06 :  *isel = pctl_isel_lpspi3_sdo; *val = 0; break;
		case pctl_mux_gpio_disp_b1_06 : *isel = pctl_isel_lpspi3_sdo; *val = 1; break;
		case pctl_mux_gpio_sd_b2_01 :   *isel = pctl_isel_lpspi4_pcs_0; *val = 0; break;
		case pctl_mux_gpio_disp_b2_15 : *isel = pctl_isel_lpspi4_pcs_0; *val = 1; break;
		case pctl_mux_gpio_sd_b2_00 :   *isel = pctl_isel_lpspi4_sck; *val = 0; break;
		case pctl_mux_gpio_disp_b2_12 : *isel = pctl_isel_lpspi4_sck; *val = 1; break;
		case pctl_mux_gpio_sd_b2_03 :   *isel = pctl_isel_lpspi4_sdi; *val = 0; break;
		case pctl_mux_gpio_disp_b2_13 : *isel = pctl_isel_lpspi4_sdi; *val = 1; break;
		case pctl_mux_gpio_sd_b2_02 :   *isel = pctl_isel_lpspi4_sdo; *val = 0; break;
		case pctl_mux_gpio_disp_b2_14 : *isel = pctl_isel_lpspi4_sdo; *val = 1; break;
		case pctl_mux_gpio_lpsr_03 :    *isel = pctl_isel_lpspi5_pcs_0; *val = 0; break;
		case pctl_mux_gpio_lpsr_13 :    *isel = pctl_isel_lpspi5_pcs_0; *val = 1; break;
		case pctl_mux_gpio_lpsr_02 :    *isel = pctl_isel_lpspi5_sck; *val = 0; break;
		case pctl_mux_gpio_lpsr_12 :    *isel = pctl_isel_lpspi5_sck; *val = 1; break;
		case pctl_mux_gpio_lpsr_05 :    *isel = pctl_isel_lpspi5_sdi; *val = 0; break;
		case pctl_mux_gpio_lpsr_15 :    *isel = pctl_isel_lpspi5_sdi; *val = 1; break;
		case pctl_mux_gpio_lpsr_04 :    *isel = pctl_isel_lpspi5_sdo; *val = 0; break;
		case pctl_mux_gpio_lpsr_14 :    *isel = pctl_isel_lpspi5_sdo; *val = 1; break;
		default: return -1;
	}

	return 0;
}


static int spi_muxVal(int spi, int mux)
{
	if ((mux >= pctl_mux_gpio_lpsr_06 &&
					mux <= pctl_mux_gpio_lpsr_08) ||
					mux == pctl_mux_gpio_lpsr_12) {
		/*
		 * Note that SPIs are numbered from zero in the configuration structure.
		 * Physical SPI5 corresponds to SPI4 in SPI init struct and
		 * physical SPI6 corresponds to SPI5 in SPI init struct (see static void spi_initPins()).
		 */
		if (spi == 4) {
			return 8;
		}
		else if (spi == 5) {
			return 4;
		}
		else {
			return -1;
		}
	}

	switch (mux) {
		case pctl_mux_gpio_ad_28 :
		case pctl_mux_gpio_ad_29 :
		case pctl_mux_gpio_ad_30 :
		case pctl_mux_gpio_ad_31 :
			return 0;

		case pctl_mux_gpio_ad_24 :
		case pctl_mux_gpio_ad_25 :
		case pctl_mux_gpio_ad_26 :
		case pctl_mux_gpio_ad_27 :
		case pctl_mux_gpio_lpsr_02 :
		case pctl_mux_gpio_lpsr_03 :
		case pctl_mux_gpio_lpsr_04 :
		case pctl_mux_gpio_lpsr_05 :
			return 1;

		case pctl_mux_gpio_ad_18 :
		case pctl_mux_gpio_ad_19 :
		case pctl_mux_gpio_ad_20 :
		case pctl_mux_gpio_ad_21 :
		case pctl_mux_gpio_ad_22 :
		case pctl_mux_gpio_ad_23 :
			return 2;

		case pctl_mux_gpio_sd_b2_06 :
			return 3;

		case pctl_mux_gpio_sd_b2_00 :
		case pctl_mux_gpio_sd_b2_01 :
		case pctl_mux_gpio_sd_b2_02 :
		case pctl_mux_gpio_sd_b2_03 :
		case pctl_mux_gpio_sd_b2_04 :
		case pctl_mux_gpio_sd_b2_05 :
		case pctl_mux_gpio_lpsr_09 :
		case pctl_mux_gpio_lpsr_10 :
		case pctl_mux_gpio_lpsr_11 :
			return 4;

		case pctl_mux_gpio_sd_b2_07 :
		case pctl_mux_gpio_sd_b2_08 :
		case pctl_mux_gpio_sd_b2_09 :
		case pctl_mux_gpio_sd_b2_10 :
		case pctl_mux_gpio_sd_b2_11 :
			return 6;

