phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/spi.c
		case pctl_mux_gpio_emc_b2_00 :
		case pctl_mux_gpio_emc_b2_01 :
		case pctl_mux_gpio_emc_b2_02 :
		case pctl_mux_gpio_emc_b2_03 :
		case pctl_mux_gpio_emc_b2_04 :
		case pctl_mux_gpio_emc_b2_05 :
		case pctl_mux_gpio_emc_b2_06 :
		case pctl_mux_gpio_emc_b2_07 :
		case pctl_mux_gpio_emc_b2_08 :
		case pctl_mux_gpio_emc_b2_09 :
		case pctl_mux_gpio_emc_b2_10 :
		case pctl_mux_gpio_lpsr_13 :
		case pctl_mux_gpio_lpsr_14 :
		case pctl_mux_gpio_lpsr_15 :
			return 8;

		case pctl_mux_gpio_disp_b1_04 :
		case pctl_mux_gpio_disp_b1_05 :
		case pctl_mux_gpio_disp_b1_06 :
		case pctl_mux_gpio_disp_b1_07 :
		case pctl_mux_gpio_disp_b1_08 :
		case pctl_mux_gpio_disp_b1_09 :
		case pctl_mux_gpio_disp_b1_10 :
		case pctl_mux_gpio_disp_b2_12 :
		case pctl_mux_gpio_disp_b2_13 :
		case pctl_mux_gpio_disp_b2_14 :
		case pctl_mux_gpio_disp_b2_15 :
			return 9;

		default :
			return -1;
	}
}


static void spi_initPins(void)
{
	int i, isel, val;
	static const struct {
		int spi;
		int mux;
	} info[] = {
#if SPI1
		{ 0, PIN2MUX(SPI1_SCK) },
		{ 0, PIN2MUX(SPI1_SDO) },
		{ 0, PIN2MUX(SPI1_SDI) },
#if defined(SPI1_PCS0) && !ISEMPTY(SPI1_PCS0)
		{ 0, PIN2MUX(SPI1_PCS0) },
#endif
#if defined(SPI1_PCS1) && !ISEMPTY(SPI1_PCS1)
		{ 0, PIN2MUX(SPI1_PCS1) },
#endif
#if defined(SPI1_PCS2) && !ISEMPTY(SPI1_PCS2)
		{ 0, PIN2MUX(SPI1_PCS2) },
#endif
#if defined(SPI1_PCS3) && !ISEMPTY(SPI1_PCS3)
		{ 0, PIN2MUX(SPI1_PCS3) },
#endif
#endif

#if SPI2
		{ 1, PIN2MUX(SPI2_SCK) },
		{ 1, PIN2MUX(SPI2_SDO) },
		{ 1, PIN2MUX(SPI2_SDI) },
#if defined(SPI2_PCS0) && !ISEMPTY(SPI2_PCS0)
		{ 1, PIN2MUX(SPI2_PCS0) },
#endif
#if defined(SPI2_PCS1) && !ISEMPTY(SPI2_PCS1)
		{ 1, PIN2MUX(SPI2_PCS1) },
#endif
#if defined(SPI2_PCS2) && !ISEMPTY(SPI2_PCS2)
		{ 1, PIN2MUX(SPI2_PCS2) },
#endif
#if defined(SPI2_PCS3) && !ISEMPTY(SPI2_PCS3)
		{ 1, PIN2MUX(SPI2_PCS3) },
#endif
#endif

#if SPI3
		{ 2, PIN2MUX(SPI3_SCK) },
		{ 2, PIN2MUX(SPI3_SDO) },
		{ 2, PIN2MUX(SPI3_SDI) },
#if defined(SPI3_PCS0) && !ISEMPTY(SPI3_PCS0)
		{ 2, PIN2MUX(SPI3_PCS0) },
#endif
#if defined(SPI3_PCS1) && !ISEMPTY(SPI3_PCS1)
		{ 2, PIN2MUX(SPI3_PCS1) },
#endif
#if defined(SPI3_PCS2) && !ISEMPTY(SPI3_PCS2)
		{ 2, PIN2MUX(SPI3_PCS2) },
#endif
#if defined(SPI3_PCS3) && !ISEMPTY(SPI3_PCS3)
		{ 2, PIN2MUX(SPI3_PCS3) },
#endif
#endif

#if SPI4
		{ 3, PIN2MUX(SPI4_SCK) },
		{ 3, PIN2MUX(SPI4_SDO) },
		{ 3, PIN2MUX(SPI4_SDI) },
#if defined(SPI4_PCS0) && !ISEMPTY(SPI4_PCS0)
		{ 3, PIN2MUX(SPI4_PCS0) },
#endif
#if defined(SPI4_PCS1) && !ISEMPTY(SPI4_PCS1)
		{ 3, PIN2MUX(SPI4_PCS1) },
#endif
#if defined(SPI4_PCS2) && !ISEMPTY(SPI4_PCS2)
		{ 3, PIN2MUX(SPI4_PCS2) },
#endif
#if defined(SPI4_PCS3) && !ISEMPTY(SPI4_PCS3)
		{ 3, PIN2MUX(SPI4_PCS3) },
#endif
#endif

#if SPI5
		{ 4, PIN2MUX(SPI5_SCK) },
		{ 4, PIN2MUX(SPI5_SDO) },
		{ 4, PIN2MUX(SPI5_SDI) },
#if defined(SPI5_PCS0) && !ISEMPTY(SPI5_PCS0)
		{ 4, PIN2MUX(SPI5_PCS0) },
#endif
#if defined(SPI5_PCS1) && !ISEMPTY(SPI5_PCS1)
		{ 4, PIN2MUX(SPI5_PCS1) },
#endif
#if defined(SPI5_PCS2) && !ISEMPTY(SPI5_PCS2)
		{ 4, PIN2MUX(SPI5_PCS2) },
#endif
#if defined(SPI5_PCS3) && !ISEMPTY(SPI5_PCS3)
		{ 4, PIN2MUX(SPI5_PCS3) },
#endif
#endif

#if SPI6
		{ 5, PIN2MUX(SPI6_SCK) },
		{ 5, PIN2MUX(SPI6_SDO) },
		{ 5, PIN2MUX(SPI6_SDI) },
#if defined(SPI6_PCS0) && !ISEMPTY(SPI6_PCS0)
		{ 5, PIN2MUX(SPI6_PCS0) },
#endif
#if defined(SPI6_PCS1) && !ISEMPTY(SPI6_PCS1)
		{ 5, PIN2MUX(SPI6_PCS1) },
#endif
#if defined(SPI6_PCS2) && !ISEMPTY(SPI6_PCS2)
		{ 5, PIN2MUX(SPI6_PCS2) },
#endif
#if defined(SPI6_PCS3) && !ISEMPTY(SPI6_PCS3)
		{ 5, PIN2MUX(SPI6_PCS3) },
#endif
#endif
	};

	for (i = 0; i < sizeof(info) / sizeof(info[0]); ++i) {
		/* Check mux value validity. If invalid don't change gpio mux settings */
		int muxVal = spi_muxVal(info[i].spi, info[i].mux);
		if (muxVal >= 0) {
			common_setMux(info[i].mux, 0, muxVal);
			if (spi_getIsel(info[i].mux, &isel, &val) == 0) {
				common_setInput(isel, val);
			}
		}
	}
}

#else

static int spi_getIsel(int mux, int *isel, int *val)
{
	switch (mux) {
		case pctl_mux_gpio_sd_b0_01 :  *isel = pctl_isel_lpspi1_pcs0; *val = 0; break;
		case pctl_mux_gpio_emc_30 :    *isel = pctl_isel_lpspi1_pcs0; *val = 1; break;
		case pctl_mux_gpio_emc_27 :    *isel = pctl_isel_lpspi1_sck; *val = 0; break;
		case pctl_mux_gpio_sd_b0_00 :  *isel = pctl_isel_lpspi1_sck; *val = 1; break;
		case pctl_mux_gpio_emc_29 :    *isel = pctl_isel_lpspi1_sdi; *val = 0; break;
		case pctl_mux_gpio_sd_b0_03 :  *isel = pctl_isel_lpspi1_sdi; *val = 1; break;
		case pctl_mux_gpio_emc_28 :    *isel = pctl_isel_lpspi1_sdo; *val = 0; break;
		case pctl_mux_gpio_sd_b0_02 :  *isel = pctl_isel_lpspi1_sdo; *val = 1; break;
		case pctl_mux_gpio_sd_b1_06 :  *isel = pctl_isel_lpspi2_pcs0; *val = 0; break;
		case pctl_mux_gpio_emc_01 :    *isel = pctl_isel_lpspi2_pcs0; *val = 1; break;
		case pctl_mux_gpio_sd_b1_07 :  *isel = pctl_isel_lpspi2_sck; *val = 0; break;
		case pctl_mux_gpio_emc_00 :    *isel = pctl_isel_lpspi2_sck; *val = 1; break;
		case pctl_mux_gpio_sd_b1_09 :  *isel = pctl_isel_lpspi2_sdi; *val = 0; break;
		case pctl_mux_gpio_emc_03 :    *isel = pctl_isel_lpspi2_sdi; *val = 1; break;
		case pctl_mux_gpio_sd_b1_08 :  *isel = pctl_isel_lpspi2_sdo; *val = 0; break;
		case pctl_mux_gpio_emc_02 :    *isel = pctl_isel_lpspi2_sdo; *val = 1; break;
		case pctl_mux_gpio_ad_b0_03 :  *isel = pctl_isel_lpspi3_pcs0; *val = 0; break;
		case pctl_mux_gpio_ad_b1_12 :  *isel = pctl_isel_lpspi3_pcs0; *val = 1; break;
		case pctl_mux_gpio_ad_b0_00 :  *isel = pctl_isel_lpspi3_sck; *val = 0; break;
		case pctl_mux_gpio_ad_b1_15 :  *isel = pctl_isel_lpspi3_sck; *val = 1; break;
		case pctl_mux_gpio_ad_b1_13 :  *isel = pctl_isel_lpspi3_sdi; *val = 1; break;
		case pctl_mux_gpio_ad_b0_02 :  *isel = pctl_isel_lpspi3_sdi; *val = 0; break;
		case pctl_mux_gpio_ad_b1_14 :  *isel = pctl_isel_lpspi3_sdo; *val = 1; break;
		case pctl_mux_gpio_ad_b0_01 :  *isel = pctl_isel_lpspi3_sdo; *val = 0; break;
		case pctl_mux_gpio_b0_00 :     *isel = pctl_isel_lpspi4_pcs0; *val = 0; break;
		case pctl_mux_gpio_b1_04 :     *isel = pctl_isel_lpspi4_pcs0; *val = 1; break;
		case pctl_mux_gpio_b0_03 :     *isel = pctl_isel_lpspi4_sck; *val = 0; break;
		case pctl_mux_gpio_b1_07 :     *isel = pctl_isel_lpspi4_sck; *val = 1; break;
		case pctl_mux_gpio_b0_01 :     *isel = pctl_isel_lpspi4_sdi; *val = 0; break;
		case pctl_mux_gpio_b1_05 :     *isel = pctl_isel_lpspi4_sdi; *val = 1; break;
		case pctl_mux_gpio_b0_02 :     *isel = pctl_isel_lpspi4_sdo; *val = 0; break;
		case pctl_mux_gpio_b1_06 :     *isel = pctl_isel_lpspi4_sdo; *val = 1; break;
		default: return -1;
	}

