phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/spi.c
	return 0;
}


static int spi_muxVal(int mux)
{
	switch (mux) {
		case pctl_mux_gpio_b1_04 :
		case pctl_mux_gpio_b1_05 :
		case pctl_mux_gpio_b1_06 :
		case pctl_mux_gpio_b1_07 :
			return 1;

		case pctl_mux_gpio_ad_b1_12 :
		case pctl_mux_gpio_ad_b1_13 :
		case pctl_mux_gpio_ad_b1_14 :
		case pctl_mux_gpio_ad_b1_15 :
		case pctl_mux_gpio_emc_00 :
		case pctl_mux_gpio_emc_01 :
		case pctl_mux_gpio_emc_02 :
		case pctl_mux_gpio_emc_03 :
		case pctl_mux_gpio_emc_40 :
		case pctl_mux_gpio_emc_41 :
		case pctl_mux_gpio_b1_02 :
		case pctl_mux_gpio_b1_03 :
			return 2;

		case pctl_mux_gpio_b0_00 :
		case pctl_mux_gpio_b0_01 :
		case pctl_mux_gpio_b0_02 :
		case pctl_mux_gpio_b0_03 :
		case pctl_mux_gpio_emc_27 :
		case pctl_mux_gpio_emc_28 :
		case pctl_mux_gpio_emc_29 :
		case pctl_mux_gpio_emc_30 :
		case pctl_mux_gpio_emc_31 :
			return 3;

		case pctl_mux_gpio_b1_11 :
			return 6;

		case pctl_mux_gpio_ad_b0_00 :
		case pctl_mux_gpio_ad_b0_01 :
		case pctl_mux_gpio_ad_b0_02 :
		case pctl_mux_gpio_ad_b0_03 :
		case pctl_mux_gpio_ad_b0_04 :
		case pctl_mux_gpio_ad_b0_05 :
		case pctl_mux_gpio_ad_b0_06 :
			return 7;

		default :
			return 4;
	}
}


static void spi_initPins(void)
{
	int i, isel, val;
	static const int muxes[] = {
	/* clang-format off */
#if SPI1
		PIN2MUX(SPI1_SCK), PIN2MUX(SPI1_SDO), PIN2MUX(SPI1_SDI),
#if defined(SPI1_PCS0) && !ISEMPTY(SPI1_PCS0)
		PIN2MUX(SPI1_PCS0),
#endif
#if defined(SPI1_PCS1) && !ISEMPTY(SPI1_PCS1)
		PIN2MUX(SPI1_PCS1),
#endif
#if defined(SPI1_PCS2) && !ISEMPTY(SPI1_PCS2)
		PIN2MUX(SPI1_PCS2),
#endif
#if defined(SPI1_PCS3) && !ISEMPTY(SPI1_PCS3)
		PIN2MUX(SPI1_PCS3),
#endif
#endif

#if SPI2
		PIN2MUX(SPI2_SCK), PIN2MUX(SPI2_SDO), PIN2MUX(SPI2_SDI),
#if defined(SPI2_PCS0) && !ISEMPTY(SPI2_PCS0)
		PIN2MUX(SPI2_PCS0),
#endif
#if defined(SPI2_PCS1) && !ISEMPTY(SPI2_PCS1)
		PIN2MUX(SPI2_PCS1),
#endif
#if defined(SPI2_PCS2) && !ISEMPTY(SPI2_PCS2)
		PIN2MUX(SPI2_PCS2),
#endif
#if defined(SPI2_PCS3) && !ISEMPTY(SPI2_PCS3)
		PIN2MUX(SPI2_PCS3),
#endif
#endif

#if SPI3
		PIN2MUX(SPI3_SCK), PIN2MUX(SPI3_SDO), PIN2MUX(SPI3_SDI),
#if defined(SPI3_PCS0) && !ISEMPTY(SPI3_PCS0)
		PIN2MUX(SPI3_PCS0),
#endif
#if defined(SPI3_PCS1) && !ISEMPTY(SPI3_PCS1)
		PIN2MUX(SPI3_PCS1),
#endif
#if defined(SPI3_PCS2) && !ISEMPTY(SPI3_PCS2)
		PIN2MUX(SPI3_PCS2),
#endif
#if defined(SPI3_PCS3) && !ISEMPTY(SPI3_PCS3)
		PIN2MUX(SPI3_PCS3),
#endif
#endif

#if SPI4
		PIN2MUX(SPI4_SCK), PIN2MUX(SPI4_SDO), PIN2MUX(SPI4_SDI),
#if defined(SPI4_PCS0) && !ISEMPTY(SPI4_PCS0)
		PIN2MUX(SPI4_PCS0),
#endif
#if defined(SPI4_PCS1) && !ISEMPTY(SPI4_PCS1)
		PIN2MUX(SPI4_PCS1),
#endif
#if defined(SPI4_PCS2) && !ISEMPTY(SPI4_PCS2)
		PIN2MUX(SPI4_PCS2),
#endif
#if defined(SPI4_PCS3) && !ISEMPTY(SPI4_PCS3)
		PIN2MUX(SPI4_PCS3),
#endif
#endif
	};
	/* clang-format on */

	for (i = 0; i < sizeof(muxes) / sizeof(muxes[0]); ++i) {
		common_setMux(muxes[i], 0, spi_muxVal(muxes[i]));

		if (spi_getIsel(muxes[i], &isel, &val) < 0)
			continue;
		common_setInput(isel, val);
	}
}

#endif


int spi_init(void)
{
	int i, spi;

	static const struct {
		volatile uint32_t *base;
		int clk;
		int irq;
	} spiInfo[] = {
		{ LPSPI1_BASE, LPSPI1_CLK, LPSPI1_IRQ },
		{ LPSPI2_BASE, LPSPI2_CLK, LPSPI2_IRQ },
		{ LPSPI3_BASE, LPSPI3_CLK, LPSPI3_IRQ },
		{ LPSPI4_BASE, LPSPI4_CLK, LPSPI4_IRQ },
#ifdef __CPU_IMXRT117X
		{ LPSPI5_BASE, LPSPI5_CLK, LPSPI5_IRQ },
		{ LPSPI6_BASE, LPSPI6_CLK, LPSPI6_IRQ }
#endif
	};

	spi_initPins();

	for (i = 0, spi = 0; spi < sizeof(spiInfo) / sizeof(spiInfo[0]); ++spi) {
		if (!spiConfig[spi])
			continue;

#ifdef __CPU_IMXRT117X
		if (common_setClock(spiInfo[spi].clk, -1, -1, -1, -1, 1) < 0)
#else
		if (common_setClock(spiInfo[spi].clk, clk_state_run) < 0)
#endif
			return -EFAULT;

		if (condCreate(&spi_common[i].cond) != EOK)
			return -ENOENT;

		if (mutexCreate(&spi_common[i].mutex) != EOK) {
			resourceDestroy(spi_common[i].cond);
			return -ENOENT;
		}

		if (mutexCreate(&spi_common[i].irqLock) != EOK) {
			resourceDestroy(spi_common[i].cond);
			resourceDestroy(spi_common[i].mutex);
			return -ENOENT;
		}

		spi_common[i].ready = 1;
		spi_common[i].irq = spiInfo[spi].irq;
		spi_common[i].base = (void *)spiInfo[spi].base;

		interrupt(spi_common[i].irq, spi_irqHandler, (void *)i, spi_common[i].cond, &spi_common[i].inth);

		/* Disable module */
		*(spi_common[i].base + spi_cr) = 0;
		++i;
	}

	return 0;
}
